benchmark/report/rps/full/20260803_220550/raw/023_music_list_c500_r1.txt
Running 1s test @ http://127.0.0.1:32776/api/music/library?offset=0&limit=20
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   114.40ms   22.69ms 136.44ms   88.60%
    Req/Sec   515.32    159.40     1.04k    84.52%
  Latency Distribution
     50%  121.21ms
     75%  125.75ms
     90%  128.84ms
     99%  134.75ms
  4315 requests in 1.10s, 2.17MB read
  Non-2xx or 3xx responses: 4315
Requests/sec:   3922.10
Transfer/sec:      1.97MB
HPS_WRK_REQUESTS 4315
HPS_WRK_STATUS_ERRORS 4315
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 4315
HPS_STATUS_2XX 0
HPS_STATUS_NON_2XX 4315
HPS_STATUS_UNEXPECTED 4315
HPS_STATUS_CODES 500=4315