benchmark/report/rps/full/20260803_220550/raw/032_download_1kb_c100_r1.txt
Running 1s test @ http://127.0.0.1:32776/api/files/by-hash/2763f706ba5bbbe3f43b69a672d4b95b389182fa2262a0914b0241146bed315e/download
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.71ms    3.04ms  29.97ms   82.18%
    Req/Sec   549.56     68.62   747.00     76.74%
  Latency Distribution
     50%   22.04ms
     75%   23.30ms
     90%   24.52ms
     99%   27.85ms
  4707 requests in 1.10s, 2.37MB read
  Non-2xx or 3xx responses: 4707
Requests/sec:   4284.56
Transfer/sec:      2.15MB
HPS_WRK_REQUESTS 4707
HPS_WRK_STATUS_ERRORS 4707
HPS_SOCKET_CONNECT 0
HPS_SOCKET_READ 0
HPS_SOCKET_WRITE 0
HPS_SOCKET_TIMEOUT 0
HPS_STATUS_TOTAL 4707
HPS_STATUS_2XX 0
HPS_STATUS_NON_2XX 4707
HPS_STATUS_UNEXPECTED 4707
HPS_STATUS_CODES 500=4707